app/views/pposts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
        <td><%= ppost.title %></td>
        <td><%= ppost.user.first_name %></td>