app/views/pposts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."ppost_id" = ?  [["ppost_id", 2]]
---
<h2>Comments</h2>
<% @ppost.comments.each do |comment| %>