app/controllers/comments_controller.rb

SELECT  "pposts".* FROM "pposts" WHERE "pposts"."id" = ? LIMIT 1  [["id", 2]]
---
  def index
    ppost = Ppost.find(params[:ppost_id])

SELECT  "pposts".* FROM "pposts" WHERE "pposts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."ppost_id" = ? AND "comments"."id" = ? LIMIT 1  [["ppost_id", 2], ["id", 2]]
---
  def show
    ppost = Ppost.find(params[:ppost_id])
    @comment = ppost.comments.find(params[:id])

SELECT  "pposts".* FROM "pposts" WHERE "pposts"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    ppost = Ppost.find(params[:ppost_id])

SELECT  "pposts".* FROM "pposts" WHERE "pposts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."ppost_id" = ? AND "comments"."id" = ? LIMIT 1  [["ppost_id", 2], ["id", 2]]
---
  def edit
    ppost = Ppost.find(params[:ppost_id])
    @comment = ppost.comments.find(params[:id])

SELECT  "pposts".* FROM "pposts" WHERE "pposts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "user_id", "ppost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "some?????????????????????"], ["user_id", 3], ["ppost_id", 2], ["created_at", "2017-03-20 00:10:39.597897"], ["updated_at", "2017-03-20 00:10:39.597897"]]
---
  def create
    ppost = Ppost.find(params[:ppost_id])
    h = comment_params
    h = h.merge("user_id" => current_user.id)
    @comment = ppost.comments.create(h)

SELECT  "pposts".* FROM "pposts" WHERE "pposts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."ppost_id" = ? AND "comments"."id" = ? LIMIT 1  [["ppost_id", 2], ["id", 2]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "hey nice posttttt"], ["updated_at", "2017-03-19 18:57:52.807494"], ["id", 2]]
---
  def update
    ppost = Ppost.find(params[:ppost_id])
    @comment = ppost.comments.find(params[:id])
    respond_to do |format|
      if @comment.update(comment_params)