app/controllers/pposts_controller.rb

  def index
    @pposts = Ppost.all.order('created_at DESC')
---
SELECT "pposts".* FROM "pposts"  ORDER BY created_at DESC

  def create
    @ppost = current_user.pposts.build(ppost_params)

    respond_to do |format|
      if @ppost.save
---
INSERT INTO "pposts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hello"], ["body", "this is the post"], ["user_id", 1], ["created_at", "2017-03-18 01:48:39.883952"], ["updated_at", "2017-03-18 01:48:39.883952"]]

  def update
    respond_to do |format|
      if @ppost.update(ppost_params)
---
UPDATE "pposts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "pposts"."id" = ?  [["title", "Edited Post"], ["body", ""], ["updated_at", "2017-03-20 21:14:12.908219"], ["id", 1]]

  def destroy
    @ppost.destroy
---
DELETE FROM "pposts" WHERE "pposts"."id" = ?  [["id", 1]]

    def set_ppost
      @ppost = Ppost.find(params[:id])
---
SELECT  "pposts".* FROM "pposts" WHERE "pposts"."id" = ? LIMIT 1  [["id", 1]]